### CONNECTIG WITH DATABASE, CREATING TABLE AND INSERTING VALUES INTO TABLES

In [1]:
import sqlite3
db=sqlite3.connect('school.sqlite')
cur=db.cursor()

In [ ]:
cur.execute('create table Student(Roll Number int primary key, Name Text, Age int)')

In [2]:
cur.execute('insert into Student values(4565,"Saurav",18)')

In [3]:
db.commit()
db.close()

In [4]:
cur.execute('insert into student values(4565,"Saurav",18)')

ProgrammingError: Cannot operate on a closed database.

### CREATING EMPLOYEE_DETAIL TABLE AND INSERT ROWS

In [5]:
import sqlite3
db=sqlite3.connect('school.sqlite')
cur=db.cursor()

In [ ]:
cur.execute('create table Employee_Detail(employee_id int primary key,name Text,Age int, Department int, Salary int)')

In [ ]:
cur.execute('insert into employee_detail(employee_id,age,department,name,salary) values(100,25,"Marketing","Rishav",50000)')
cur.execute('insert into employee_detail(employee_id,age,department,name,salary) values(101,26,"Operations","Abhishek",60000)')
cur.execute('insert into employee_detail(employee_id,age,department,name,salary) values(102,24,"Human Resource","Aman",75000)')

In [6]:
db.commit()
db.close()

### PASSING PARAMETERS IN A QUERY

In [7]:
import sqlite3
db=sqlite3.connect('school.sqlite')
cur=db.cursor()

In [8]:
name,roll,age="Sarv",4564,18
cur.execute('insert into student values(?,?,?)',(roll,name,age))

In [9]:
cur.execute('insert into student (age,name,roll) values(18,"Manjot",4566)')

In [10]:
values=[(20,4567,"Divyanshu"),(21,4571,"Anurag")]
cur.executemany('insert into student(age,roll,name) values(?,?,?)',values)

In [11]:
values=[(20,4526,'kaustav'),(21,4569,'keshav')]
cur.executemany('insert into student(age,roll,name) values(?,?,?)',values)

In [12]:
cur.execute('update student set age=22 where roll=4564')

In [13]:
age=24
cur.execute('update student set age=? where roll=4566',(age,))

In [14]:
db.commit()
db.close()

### DROP INDEX FROM EMPLOYEE_DETAIL TABLE WITHOUT PARAMETER AND WITH PARAMETER

In [ ]:
import sqlite3
db=sqlite3.connect('school.sqlite')
cur=db.cursor()

In [ ]:
cur.execute('delete from employee_detail where employee_id=101')

In [ ]:
emp_id=102
cur.execute('delete from employee_detail where employee_id=?',(emp_id,))

In [ ]:
db.commit()
db.close()

### PROBLEM - UPDATE SQL TABLE

In [ ]:
import sqlite3
db=sqlite3.connect('school.sqlite')
cur=db.cursor()

In [ ]:
employee_id=[101,102,103,104,105,106,107,108,109,110,111,112]
name=['Aadarsh','Aarti','Siddharth','Aman','Amit','Shivansh','Vaibhav','Himanshu','Raman','Kunal','Adhira','Tanya']
age=[25,27,25,24,30,26,23,26,25,26,29,24]
department=['Marketing','Operations','Finance','Human Resource','Marketing','IT','Finance','IT','Operations','Marketing','Human Resource','Marketing']
salary=[50000,60000,85000,75000,50000,90000,85000,90000,60000,50000,75000,50000]
value=[]
for i in range(12):
    value.append((name[i],age[i],employee_id[i],department[i],salary[i]))
cur.executemany('insert into employee_detail(name,age,employee_id,department,salary) values(?,?,?,?,?)',value)

In [ ]:
db.commit()
db.close()

### PROBLEM - FINANCE EMPLOYEE SQLite & PROBLEM - FIND EMPLOYEE

In [ ]:
import sqlite3
db=sqlite3.connect('school.sqlite')
cur=db.cursor()

In [ ]:
cur.execute('select employee_id from employee_detail where department="Finance"')
cur.fetchall()

In [ ]:
cur.execute('select department,count(employee_id) from employee_detail group by department order by count(employee_id)')
row=cur.fetchall()
print(row)
for ele in row:
    print(ele[0],ele[1])

In [15]:
db.close()

### SQLite WITH PANDAS

In [24]:
import sqlite3,pandas as pd
db=sqlite3.connect('school.sqlite')

In [25]:
df=pd.read_sql_query("select * from student",db)
df

   Roll       Name  Age
0  4565     Saurav   18
1  4564       Sarv   22
2  4566     Manjot   24
3  4567  Divyanshu   20
4  4571     Anurag   21
5  4526    kaustav   20
6  4569     keshav   21

In [20]:
faculty = pd.DataFrame([[201, "Aman", "English", 20000], [202, "Komal", "Maths", 22000], [203, "Mahesh", "Science", 23000]], 
                   columns = ["ID", "Name", "Course", "Salary"])
faculty

    ID    Name   Course  Salary
0  201    Aman  English   20000
1  202   Komal    Maths   22000
2  203  Mahesh  Science   23000

In [21]:
faculty.to_sql("Faculty",db)

ValueError: Table 'Faculty' already exists.

In [26]:
df=pd.read_sql_query("select * from student",db)
df["Address"]="Test"
df.to_sql("Student",db,if_exists="replace")

In [27]:
db.close()

### PROBLEM COUNT GENRE

In [70]:
import sqlite3,pandas as pd
db=sqlite3.connect('IMDB.sqlite')
cur=db.cursor()

In [75]:
row=cur.execute('select genre,count(movie_id) from genre where genre!="" group by genre')

In [72]:
li=[]
for ele in row:
    li.append(ele)
    print(ele)

('Action', 33)
('Adventure', 43)
('Animation', 13)
('Biography', 21)
('Comedy', 31)
('Crime', 11)
('Drama', 77)
('Family', 3)
('Fantasy', 7)
('History', 6)
('Horror', 2)
('Music', 3)
('Musical', 1)
('Mystery', 7)
('Romance', 13)
('Sci-Fi', 18)
('Sport', 3)
('Thriller', 14)
('War', 2)
('Western', 2)

In [76]:
for ele in row:
    print(ele[0],ele[1])

Action 33
Adventure 43
Animation 13
Biography 21
Comedy 31
Crime 11
Drama 77
Family 3
Fantasy 7
History 6
Horror 2
Music 3
Musical 1
Mystery 7
Romance 13
Sci-Fi 18
Sport 3
Thriller 14
War 2
Western 2

In [68]:
db.close()

### PROBLEM - IMDB MOVIE

In [82]:
import sqlite3,pandas as pd
db=sqlite3.connect('IMDB.sqlite')
cur=db.cursor()

In [89]:
row=cur.execute('select earning.movie_id,earning.domestic,earning.worldwide,imdb.rating from earning join imdb on earning.movie_id=imdb.movie_id')

In [90]:
li=[]
for ele in row:
    li.append(ele)

In [112]:
df=pd.DataFrame(li,columns=["movie_id","domestic","worldwide","rating"])
df["total"]=df["domestic"]+df["worldwide"]
df1=df.loc[:,["rating","total"]]
arr=df1.total.values
ind=arr.argsort()
df1.iloc[ind[-1]]

rating    8.100000e+00
total     3.004886e+09
Name: 79, dtype: float64